{
  "backend/main.mo": "Main backend actor that includes blob storage mixin and provides contact form submission functionality with methods to submit, retrieve all, and filter submissions by project type or email.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: responsive grid layout for PortfolioGallery and fixing broken image paths for 120 portfolio images across 4 categories.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, UI primitives, and configuration files for the Casa Di Vida interior design website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark themes, including warm earth tones and gold accents for luxury design aesthetic.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and title for Casa Di Vida Interior Decoration and Designs.",
  "frontend/src/App.tsx": "Root React component that renders Navigation, all main sections (Hero, Services, Portfolio, About, Contact), Footer, and Toaster with smooth scroll behavior.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying Casa Di Vida's design philosophy, company values (Passion, Excellence, Client-Centered, Timeless Beauty) in a grid layout with icons and descriptive text.",
  "frontend/src/components/ContactForm.tsx": "React Hook Form-based contact form with validation for name, email, phone, project type, and message fields, integrated with backend submission via useContactSubmission hook and toast notifications.",
  "frontend/src/components/ContactSection.tsx": "Contact section wrapper displaying ContactForm alongside business contact information (email, phone, location) and office hours in a two-column layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Casa Di Vida branding, quick navigation links with smooth scrolling, contact information, and copyright notice with a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with full-screen background image, Casa Di Vida branding, call-to-action buttons for contact and portfolio, and an animated scroll indicator.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with smooth scrolling to sections, active section highlighting, responsive mobile sheet menu, and background blur effect on scroll.",
  "frontend/src/components/PortfolioGallery.tsx": "Portfolio gallery component with tabbed categories (home, office, commercial) displaying project images in a grid with modal dialog for detailed views and descriptions.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying four interior design services (Space Planning, Color Consultation, Furniture Selection, Full Room Design) in a card grid with icons and images.",
  "frontend/src/hooks/useActor.ts": "React hook managing backend actor creation with Internet Identity authentication, caching via React Query, and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useContactSubmission.ts": "React hook providing a mutation for submitting contact form data to the backend actor with automatic query invalidation on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with AuthClient integration.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining a luxury interior design color scheme using warm earth tones, creams, and gold accents with Playfair Display and Inter fonts.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "React application entry point setting up QueryClient, InternetIdentityProvider, and rendering the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme with custom colors (oklch-based luxury palette), typography, animations, and design tokens for the interior design aesthetic.",
  "project_state.json": "Project metadata defining Casa Di Vida interior design website requirements including hero section, services, 120-image portfolio gallery across 4 categories, about section, and contact form with backend integration."
}