{
  "backend/main.mo": "Main backend actor that includes blob storage mixin and provides contact form submission functionality with methods to store, retrieve all, and filter submissions by project type or email.",
  "feature_evidence.json": "Feature evidence report documenting three portfolio gallery image rendering features related to fixing image paths, verifying filenames, and rendering all 120 generated images with proper titles and descriptions.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, UI elements, and configuration files for the Casa Di Vida interior design website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark themes, including warm earth tones and design tokens for the luxury interior design aesthetic.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script loading for Casa Di Vida Interior Decoration and Designs.",
  "frontend/src/App.tsx": "Root React component that orchestrates the entire single-page application layout with Navigation, Hero, Services, Portfolio, About, Contact sections, Footer, and Toaster notifications.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying Casa Di Vida's design philosophy, company values (Passion, Excellence, Client-Centered, Timeless Beauty) with icons, and a featured quote about their approach.",
  "frontend/src/components/ContactForm.tsx": "React Hook Form-based contact form with validation for name, email, phone, project type, and message fields, integrated with backend submission via useContactSubmission hook and toast notifications.",
  "frontend/src/components/ContactSection.tsx": "Contact section wrapper displaying ContactForm alongside business information including email, phone, location, and office hours with icon-decorated contact methods.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Casa Di Vida branding, quick navigation links with smooth scrolling, contact information, and copyright notice with a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with full-screen background image, Casa Di Vida branding, call-to-action buttons for contact and portfolio, and an animated scroll indicator.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with smooth scrolling to sections, active section highlighting, responsive mobile menu using Sheet component, and transparent-to-solid background transition on scroll.",
  "frontend/src/components/PortfolioGallery.tsx": "Portfolio gallery component with tabbed categories (home, office, commercial, outdoor) displaying project images in a grid with modal dialog for viewing full details and descriptions.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying four interior design services (Space Planning, Color Consultation, Furniture Selection, Full Room Design) in card format with icons, images, and descriptions.",
  "frontend/src/hooks/useActor.ts": "React hook that manages backend actor creation with Internet Identity authentication, automatically invalidating and refetching dependent queries when identity changes.",
  "frontend/src/hooks/useContactSubmission.ts": "React Query mutation hook for submitting contact form data to the backend actor, with automatic query invalidation on successful submission.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and context provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining a luxury interior design color scheme using warm earth tones, creams, and gold accents in both light and dark modes, plus custom typography with Playfair Display and Inter fonts.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point wrapping the App component with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (oklch-based luxury palette with gold accents), typography, animations, and plugins for a sophisticated interior design aesthetic.",
  "project_state.json": "Project metadata defining Casa Di Vida as a luxury interior design showcase website requiring a portfolio with 120 images across 4 categories (Home, Commercial, Office, Hotels) and contact form backend storage."
}