{
  "backend/main.mo": "Main backend actor with blob storage mixin that handles contact form submissions, storing ContactSubmission records with name, email, phone, projectType, message, and timestamp, and provides query methods to retrieve submissions by project type or email.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: the tabbed portfolio gallery component with four categories and the rendering of 120 generated portfolio images (30 per category) with titles and descriptions in a lightbox interface.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, UI primitives, and configuration files for the Casa Di Vida interior design website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark themes, including warm earth tones, gold accents, and design tokens for borders, shadows, and UI elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Casa Di Vida Interior Decoration and Designs', and root div mounting the React application from main.tsx.",
  "frontend/src/App.tsx": "Root React component that enables smooth scrolling and renders the complete page structure: Navigation, HeroSection, ServicesSection, PortfolioGallery, AboutSection, ContactSection, Footer, and Toaster for notifications.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying Casa Di Vida's design philosophy, company story, and four core values (Passion, Excellence, Client-Centered, Timeless Beauty) with icons in an elegant grid layout.",
  "frontend/src/components/ContactForm.tsx": "React Hook Form-based contact form with validation for name, email, phone, project type select, and message fields that submits to backend via useContactSubmission hook and displays success/error toasts.",
  "frontend/src/components/ContactSection.tsx": "Contact section wrapper displaying ContactForm alongside business information including email, phone, location, and office hours in a two-column grid layout with decorative icons.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Casa Di Vida branding, navigation links with smooth scrolling, contact information, and copyright notice with a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Hero section component with full-screen background image, Casa Di Vida title and tagline, call-to-action buttons for contact and portfolio, and animated scroll indicator.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with smooth scrolling to sections, active section highlighting, responsive mobile sheet menu, and background blur effect on scroll.",
  "frontend/src/components/PortfolioGallery.tsx": "Portfolio gallery component with tabbed categories (home, office, hospitality), grid layout of project images with titles and descriptions, and modal dialog for viewing full-size images.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying four interior design services (Space Planning, Color Consultation, Furniture Selection, Full Room Design) in card format with icons, images, and descriptions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages backend actor creation with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useContactSubmission.ts": "React Query mutation hook for submitting contact form data to the backend actor, with automatic query invalidation on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration defining a luxury interior design color scheme using OKLCH colors (warm earth tones, creams, browns, gold accents) and custom font families (Playfair Display for headings, Inter for body).",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name merging.",
  "frontend/src/main.tsx": "React application entry point wrapping the App with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (using OKLCH), typography, animations (accordion, fade-in), and luxury design tokens (elegant shadows, serif/sans fonts).",
  "project_state.json": "Project metadata describing Casa Di Vida Interior Decoration website with 4 portfolio categories (Home, Commercial, Office, Hotels) requiring 120 total images and contact form backend storage."
}