{
  "kind": "build_request",
  "title": "Fix portfolio gallery image loading and implement grid layout",
  "projectName": "Casa Di Vida",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Update the PortfolioGallery component to use a responsive grid layout for displaying portfolio images. The grid should adapt to different screen sizes (e.g., 1 column on mobile, 2-3 columns on tablet, 3-4 columns on desktop) with consistent spacing between images.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Display pictures in portfolio in grid layout"
        ]
      },
      "acceptanceCriteria": [
        "Portfolio images display in a responsive grid layout",
        "Grid adapts appropriately across mobile, tablet, and desktop viewports",
        "Images maintain consistent spacing and alignment within the grid",
        "Grid layout is applied to all four categories (Home, Commercial, Office, Hotels)"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Fix the broken image icons in the PortfolioGallery component by correcting the image path references. Ensure all 120 portfolio images (30 per category: home-1.png through home-30.png, commercial-1.png through commercial-30.png, office-1.png through office-30.png, hotels-1.png through hotels-30.png) load correctly from the /assets/generated/ directory using proper public asset paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Images in categories of portfolio cannot load, showing broken image icon"
        ]
      },
      "acceptanceCriteria": [
        "All 120 portfolio images display without broken image icons",
        "Image paths correctly reference /assets/generated/ directory using public asset paths",
        "Each category (Home, Commercial, Office, Hotels) displays all 30 of its images successfully",
        "Images load properly when switching between tabs"
      ]
    }
  ],
  "constraints": [
    "Do not modify the immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "Maintain the existing dialog-based lightbox interface for viewing full image details",
    "Preserve the existing tab navigation structure for the four categories"
  ],
  "nonGoals": [
    "Changing the total number of images or adding new categories",
    "Modifying the backend contact form functionality",
    "Altering the image generation process or filenames",
    "Redesigning the lightbox/modal dialog component"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}